//
// Created by Sergey Kostyuk (http://git.io/vBvMH) on 28.12.15.
//

/*****************************************************************************/

#ifndef _CONTROLLER_HPP_
#define _CONTROLLER_HPP_

/*****************************************************************************/

#include "implementation/combinational_circuit.hpp"

/*****************************************************************************/

#include <iostream>

/*****************************************************************************/

class Controller {

	// TODO: Как-то мало он делает...

public:

	/*-----------------------------------------------------------------*/

	Controller( std::unique_ptr< CombinationalCircuit > _storedC );

	~Controller() = default;

	/*-----------------------------------------------------------------*/

	void executeTestFile( std::istream & _input, std::ostream & _output );

	/*-----------------------------------------------------------------*/

private:

	/*-----------------------------------------------------------------*/

	std::unique_ptr< CombinationalCircuit > m_circuit;

	/*-----------------------------------------------------------------*/

};

/*****************************************************************************/

#endif //_CONTROLLER_HPP_
